In [1]:
# Session 12 SQL-1 Assignment

In [2]:
# Create a sql db from adult dataset and name it sqladb

In [3]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series
import sqlite3 as db
from pandasql import sqldf

In [15]:
pysqldf = lambda q: sqldf(q, globals())
from pandasql import sqldf

In [21]:
sqladb=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',
                   names=['Age','workclass','fnlwgt','education','education-num','marital- status',
                          'occupation','relationship','race','sex','capital-gain','capital-loss',
                          'hours-per-week','native- country','>50K, <=50K'])

In [17]:
sqladb.head(5)

,Age,workclass,fnlwgt,education,education-num,marital- status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native- country,">50K, <=50K"
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [10]:
#Q1: select 10 records from the adult sqladb
pysqldf("SELECT * FROM sqladb LIMIT 10;")

In [ ]:
# Q2: Show me the average hours per week of all men working private sec

pysqldf("SELECT sex,workclass, avg(hours_per_week) from sqladb where sex='Male' and workclass='Private' ;")

In [ ]:
# Q3: show the frequency table for edcuation, occupation and relationship

pysqldf("SELECT education,count(eduation) from sqladb group by education ;")

In [ ]:
# by occupation

pysqldf("SELECT occupation, count(occupation) form sqladb group by occupation ;")

In [ ]:
# by relationship

pysqldf("SELECT relationship, count(relationship) form sqladb group by relationship ;")

In [ ]:
# Q4: Are there people who are married, working in Private and have MA

pysqldf("""SELECT workclass,educaiton, 'Married' , count(*)
        from sqladb where workclass='Private' and educaiton='Masters'
        and marital_Status in ('Married-civ-spouse','Married-spouse-absent',
        'Married-AF-spouse')
        group by workclass,education;""")

In [ ]:
# Q5: What is the average, minimum and maximum age group for people working in diff sectors

pysqldf("SELECT workclass,avg(Age),min(Age),max(Age) from sqladb group by workclass ;")

In [ ]:
#Q:6 calculate age distribution by country

pysqldf("""SELECT native_country ,Age,count(Age) from sqladb a
            where a.native_country <> '?'
                group by a.native_country,a.Age order by 1 ; """)

In [ ]:
# Q7: compute a new column as 'Net-Capital-Gain' form the two columns 'capital-gain and 'capital-loss

pysqldf("""SELECT *, (capital_gain-capital_loss) 'Net-Capital-Gain' from sqladb a ;""")